---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.FailToReOrientSketchCurvesFailure
source: html/99b540f9-e1b2-6996-eaaf-bf822433dfbf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.FailToReOrientSketchCurvesFailure Property

Failed to orient sketch curves.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailToReOrientSketchCurvesFailure { get; }
```